<!-- attach-outputs:plan-nodes-prod.txt -->
  <!-- Output: plan-nodes-prod.txt -->
  #### plan-nodes-prod.txt 📖: `test: success, prod: success`

  **Last updated:** Jan 5, 2026, 02:51 AM UTC

  <details><summary>Show Contents</summary>

  ```

  
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.cluster.module.talos-vm["tiles-wk-1"].proxmox_virtual_environment_vm.main has changed
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7221"
      ~ ipv4_addresses                       = [
            # (20 unchanged elements hidden)
            [],
          + [],
        ]
      ~ ipv6_addresses                       = [
            # (20 unchanged elements hidden)
            [
                "fe80::200:ff:fe00:0",
            ],
          + [
              + "fe80::200:ff:fe00:0",
            ],
        ]
      ~ mac_addresses                        = [
            # (20 unchanged elements hidden)
            "00:00:00:00:00:00",
          + "00:00:00:00:00:00",
        ]
        name                                 = "tiles-wk-1"
      ~ network_interface_names              = [
            # (20 unchanged elements hidden)
            "lxca392b5fc353e",
          + "lxc231ef142b1a9",
        ]
        tags                                 = []
        # (30 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-wk-2"].proxmox_virtual_environment_vm.main has changed
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7222"
      ~ ipv4_addresses                       = [
            # (19 unchanged elements hidden)
            [],
          - [],
        ]
      ~ ipv6_addresses                       = [
            # (19 unchanged elements hidden)
            [
                "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
        ]
      ~ mac_addresses                        = [
            # (19 unchanged elements hidden)
            "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
        ]
        name                                 = "tiles-wk-2"
      ~ network_interface_names              = [
            # (19 unchanged elements hidden)
            "lxc017fad6f581a",
          - "lxcef24e117196e",
        ]
        tags                                 = []
        # (30 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # proxmox_virtual_environment_download_file.talos_iso["nuc-g2p-1"] must be replaced
-/+ resource "proxmox_virtual_environment_download_file" "talos_iso" {
      ~ file_name           = "talos-p-v1.12.0-nocloud-amd64-10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67.iso" -> (known after apply) # forces replacement
      ~ id                  = "local:iso/talos-p-v1.12.0-nocloud-amd64-10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67.iso" -> (known after apply)
      ~ size                = 315961344 -> (known after apply)
      ~ url                 = "https://factory.talos.dev/image/10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67/v1.12.0/nocloud-amd64.iso" -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # proxmox_virtual_environment_download_file.talos_iso["nuc-g2p-2"] must be replaced
-/+ resource "proxmox_virtual_environment_download_file" "talos_iso" {
      ~ file_name           = "talos-p-v1.12.0-nocloud-amd64-10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67.iso" -> (known after apply) # forces replacement
      ~ id                  = "local:iso/talos-p-v1.12.0-nocloud-amd64-10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67.iso" -> (known after apply)
      ~ size                = 315961344 -> (known after apply)
      ~ url                 = "https://factory.talos.dev/image/10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67/v1.12.0/nocloud-amd64.iso" -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # proxmox_virtual_environment_download_file.talos_iso["nuc-g3p-1"] must be replaced
-/+ resource "proxmox_virtual_environment_download_file" "talos_iso" {
      ~ file_name           = "talos-p-v1.12.0-nocloud-amd64-10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67.iso" -> (known after apply) # forces replacement
      ~ id                  = "local:iso/talos-p-v1.12.0-nocloud-amd64-10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67.iso" -> (known after apply)
      ~ size                = 315961344 -> (known after apply)
      ~ url                 = "https://factory.talos.dev/image/10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67/v1.12.0/nocloud-amd64.iso" -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # proxmox_virtual_environment_download_file.talos_iso["nuc-g3p-2"] must be replaced
-/+ resource "proxmox_virtual_environment_download_file" "talos_iso" {
      ~ file_name           = "talos-p-v1.12.0-nocloud-amd64-10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67.iso" -> (known after apply) # forces replacement
      ~ id                  = "local:iso/talos-p-v1.12.0-nocloud-amd64-10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67.iso" -> (known after apply)
      ~ size                = 315961344 -> (known after apply)
      ~ url                 = "https://factory.talos.dev/image/10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67/v1.12.0/nocloud-amd64.iso" -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # talos_image_factory_schematic.metal_amd will be created
  + resource "talos_image_factory_schematic" "metal_amd" {
      + id        = (known after apply)
      + schematic = <<-EOT
            "customization":
              "extraKernelArgs":
              - "-talos.halt_if_installed"
              "systemExtensions":
                "officialExtensions":
                - "siderolabs/amdgpu"
                - "siderolabs/amd-ucode"
        EOT
    }

  # talos_image_factory_schematic.this will be destroyed
  # (because talos_image_factory_schematic.this is not in configuration)
  - resource "talos_image_factory_schematic" "this" {
      - id        = "10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67" -> null
      - schematic = <<-EOT
            "customization":
              "extraKernelArgs":
              - "vga=792"
              - "-talos.halt_if_installed"
              "systemExtensions":
                "officialExtensions":
                - "siderolabs/qemu-guest-agent"
        EOT -> null
    }

  # talos_image_factory_schematic.vm will be created
  + resource "talos_image_factory_schematic" "vm" {
      + id        = (known after apply)
      + schematic = <<-EOT
            "customization":
              "extraKernelArgs":
              - "vga=792"
              - "-talos.halt_if_installed"
              "systemExtensions":
                "officialExtensions":
                - "siderolabs/qemu-guest-agent"
        EOT
    }

  # module.cluster.onepassword_item.kubeconfig will be created
  + resource "onepassword_item" "kubeconfig" {
      + category   = "secure_note"
      + id         = (known after apply)
      + note_value = (sensitive value)
      + password   = (sensitive value)
      + title      = "tiles-kubeconfig"
      + uuid       = (known after apply)
      + vault      = "lyyqeg3pe6dvqdeb5hbiu7b76y"

      + section {
          + id    = (known after apply)
          + label = "metadata"

          + field {
              + id    = (known after apply)
              + label = "source"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "root_module"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "module"
              + type  = "STRING"
              + value = (sensitive value)
            }
        }
    }

  # module.cluster.onepassword_item.misc_config will be updated in-place
  # (moved from module.cluster.onepassword_item.misc_config[0])
  ~ resource "onepassword_item" "misc_config" {
        id       = "vaults/lyyqeg3pe6dvqdeb5hbiu7b76y/items/txizvv5dzvi7kbg5ktq5ngjpsi"
      + password = (sensitive value)
        # (4 unchanged attributes hidden)

      ~ section {
            id    = "ab2a327c-f3a1-12c9-8d38-26da063ef8cb"
            # (1 unchanged attribute hidden)

          ~ field {
                id    = "ead1b4df-21aa-8fa4-2381-ebb43c21f3dd"
              ~ label = "control_plane_vip_link" -> "talos_vm_install_image"
              ~ value = (sensitive value)
                # (1 unchanged attribute hidden)
            }
          ~ field {
                id    = "f31aec39-9c6c-ffaf-614f-9eeab0ba1c88"
              ~ label = "talos_install_image" -> "bootstrap_ip"
              ~ value = (sensitive value)
                # (1 unchanged attribute hidden)
            }
          ~ field {
                id    = "7ee660e5-feb2-72dc-ce4e-b1ae559477bf"
              ~ label = "control_plane_ips" -> "worker_ips"
              ~ value = (sensitive value)
                # (1 unchanged attribute hidden)
            }
          - field {
              - id    = "aefafa89-2325-c2c9-c126-27605323f9cd" -> null
              - label = "bootstrap_ip" -> null
              - type  = "STRING" -> null
              - value = (sensitive value) -> null
            }
          - field {
              - id    = "2f2e9e12-6f2b-1293-f00e-ad85340fdde2" -> null
              - label = "worker_ips" -> null
              - type  = "STRING" -> null
              - value = (sensitive value) -> null
            }

            # (11 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.cluster.onepassword_item.talosconfig[0] has moved to module.cluster.onepassword_item.talosconfig
    resource "onepassword_item" "talosconfig" {
        id         = "vaults/lyyqeg3pe6dvqdeb5hbiu7b76y/items/vxdy5ydalqovc3fwbhnwi44tla"
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.cluster.talos_cluster_kubeconfig.this will be created
  + resource "talos_cluster_kubeconfig" "this" {
      + certificate_renewal_duration    = "720h"
      + client_configuration            = {
          + ca_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJQekNCOHFBREFnRUNBaEVBNENrcWNhSCs2dW1yRTlNakFRZFMwVEFGQmdNclpYQXdFREVPTUF3R0ExVUUKQ2hNRmRHRnNiM013SGhjTk1qWXdNVEF6TURFME9UQXlXaGNOTXpZd01UQXhNREUwT1RBeVdqQVFNUTR3REFZRApWUVFLRXdWMFlXeHZjekFxTUFVR0F5dGxjQU1oQUFwM01sTVRSZ202YU9vT3dBZ0FCY1ozSnBUbVA1TjM1OEtoClJLU1g1K1pWbzJFd1h6QU9CZ05WSFE4QkFmOEVCQU1DQW9Rd0hRWURWUjBsQkJZd0ZBWUlLd1lCQlFVSEF3RUcKQ0NzR0FRVUZCd01DTUE4R0ExVWRFd0VCL3dRRk1BTUJBZjh3SFFZRFZSME9CQllFRkd1N0dnUk1WWG8wRmZQMwpuQTY4TXVmNmdpMXBNQVVHQXl0bGNBTkJBTWFQTWREaXBkS2M0MndxakNzUDIvMWlEYXA0RC9QV0Vsc3hzazRFCjRwbnpKdmR0ZzZ2QzVLUGxjZlpkdk5VaDBDWmUvampFcWhicWhSUW4wYitkOVFBPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
          + client_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJLVENCM0tBREFnRUNBaEVBaHJlc3BrRGhrSjQwQ2FyRVczTUJmakFGQmdNclpYQXdFREVPTUF3R0ExVUUKQ2hNRmRHRnNiM013SGhjTk1qWXdNVEF6TURFME9UQXlXaGNOTWpjd01UQXpNREUwT1RBeVdqQVRNUkV3RHdZRApWUVFLRXdodmN6cGhaRzFwYmpBcU1BVUdBeXRsY0FNaEFMdTVuclR2aFJCdmF0RWR1cmI2RGlFQTdsdU9tTkxjCm13ZTlvQW9RRGhQUG8wZ3dSakFPQmdOVkhROEJBZjhFQkFNQ0I0QXdFd1lEVlIwbEJBd3dDZ1lJS3dZQkJRVUgKQXdJd0h3WURWUjBqQkJnd0ZvQVVhN3NhQkV4VmVqUVY4L2VjRHJ3eTUvcUNMV2t3QlFZREsyVndBMEVBZStQdwpaRFcxS3lGbUswVmZ5eGtteGRwRWxMYk8wWnhUT3JTSElhYkk0TU5wbWVYR0FKN3k3ZzBnTmF4d0RxSkZ0NnZ6CkVDRU9GZ0Y1emNueTNFeWFDdz09Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
          + client_key         = (sensitive value)
        }
      + endpoint                        = "10.0.128.11"
      + id                              = (known after apply)
      + kubeconfig_raw                  = (sensitive value)
      + kubernetes_client_configuration = (known after apply)
      + node                            = "10.0.128.11"
    }

  # module.cluster.talos_machine_bootstrap.this will be created
  + resource "talos_machine_bootstrap" "this" {
      + client_configuration = {
          + ca_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJQekNCOHFBREFnRUNBaEVBNENrcWNhSCs2dW1yRTlNakFRZFMwVEFGQmdNclpYQXdFREVPTUF3R0ExVUUKQ2hNRmRHRnNiM013SGhjTk1qWXdNVEF6TURFME9UQXlXaGNOTXpZd01UQXhNREUwT1RBeVdqQVFNUTR3REFZRApWUVFLRXdWMFlXeHZjekFxTUFVR0F5dGxjQU1oQUFwM01sTVRSZ202YU9vT3dBZ0FCY1ozSnBUbVA1TjM1OEtoClJLU1g1K1pWbzJFd1h6QU9CZ05WSFE4QkFmOEVCQU1DQW9Rd0hRWURWUjBsQkJZd0ZBWUlLd1lCQlFVSEF3RUcKQ0NzR0FRVUZCd01DTUE4R0ExVWRFd0VCL3dRRk1BTUJBZjh3SFFZRFZSME9CQllFRkd1N0dnUk1WWG8wRmZQMwpuQTY4TXVmNmdpMXBNQVVHQXl0bGNBTkJBTWFQTWREaXBkS2M0MndxakNzUDIvMWlEYXA0RC9QV0Vsc3hzazRFCjRwbnpKdmR0ZzZ2QzVLUGxjZlpkdk5VaDBDWmUvampFcWhicWhSUW4wYitkOVFBPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
          + client_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJLVENCM0tBREFnRUNBaEVBaHJlc3BrRGhrSjQwQ2FyRVczTUJmakFGQmdNclpYQXdFREVPTUF3R0ExVUUKQ2hNRmRHRnNiM013SGhjTk1qWXdNVEF6TURFME9UQXlXaGNOTWpjd01UQXpNREUwT1RBeVdqQVRNUkV3RHdZRApWUVFLRXdodmN6cGhaRzFwYmpBcU1BVUdBeXRsY0FNaEFMdTVuclR2aFJCdmF0RWR1cmI2RGlFQTdsdU9tTkxjCm13ZTlvQW9RRGhQUG8wZ3dSakFPQmdOVkhROEJBZjhFQkFNQ0I0QXdFd1lEVlIwbEJBd3dDZ1lJS3dZQkJRVUgKQXdJd0h3WURWUjBqQkJnd0ZvQVVhN3NhQkV4VmVqUVY4L2VjRHJ3eTUvcUNMV2t3QlFZREsyVndBMEVBZStQdwpaRFcxS3lGbUswVmZ5eGtteGRwRWxMYk8wWnhUT3JTSElhYkk0TU5wbWVYR0FKN3k3ZzBnTmF4d0RxSkZ0NnZ6CkVDRU9GZ0Y1emNueTNFeWFDdz09Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
          + client_key         = (sensitive value)
        }
      + endpoint             = "10.0.128.11"
      + id                   = (known after apply)
      + node                 = "10.0.128.11"
    }

  # module.cluster.module.talos-vm["tiles-cp-1"].proxmox_virtual_environment_vm.main will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7211"
      ~ ipv4_addresses                       = [
          - [
              - "127.0.0.1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "10.0.128.11",
              - "10.0.128.10",
            ],
          - [],
          - [
              - "10.0.148.72",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
        ] -> (known after apply)
      ~ ipv6_addresses                       = [
          - [
              - "::1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "fe80::be24:11ff:fed0:7211",
            ],
          - [
              - "fe80::8cd3:2cff:fe64:984d",
            ],
          - [
              - "fe80::4c06:13ff:fe8d:8cb4",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
        ] -> (known after apply)
        name                                 = "tiles-cp-1"
      ~ network_interface_names              = [
          - "lo",
          - "bond0",
          - "dummy0",
          - "teql0",
          - "tunl0",
          - "sit0",
          - "ip6tnl0",
          - "eth0",
          - "cilium_net",
          - "cilium_host",
          - "lxc_health",
          - "lxc4015c7697891",
          - "lxc577fe19215cb",
          - "lxc66137d991fb1",
          - "lxce9c54078cd6e",
          - "lxc01dddf91f1dd",
          - "lxc0b8290d1b534",
        ] -> (known after apply)
      ~ started                              = true -> false
        tags                                 = []
        # (30 unchanged attributes hidden)

      ~ cdrom {
          ~ file_id   = "local:iso/talos-p-v1.12.0-nocloud-amd64-10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67.iso" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-cp-1"].talos_machine_configuration_apply.this will be created
  + resource "talos_machine_configuration_apply" "this" {
      + apply_mode                  = "auto"
      + client_configuration        = (sensitive value)
      + config_patches              = [
          + <<-EOT
                version: v1alpha1
                cluster:
                  network:
                    # cilium will become our CNI.
                    cni:
                      name: none
                  controllerManager:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  scheduler:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  apiServer:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  proxy:
                    # Cilium will replace the proxy
                    disabled: true
                machine:
                  sysctls:
                    user.max_user_namespaces: "8192"
                  # https://www.talos.dev/v1.10/talos-guides/configuration/containerd/#exposing-metrics
                  files:
                    - content: |
                        [metrics]
                          address = "0.0.0.0:11234"
                      path: /etc/cri/conf.d/20-customization.part
                      op: create
                  features:
                    rbac: true
                    diskQuotaSupport: true
                    hostDNS:
                      enabled: true
                      resolveMemberNames: true
                      forwardKubeDNSToHost: false
                    imageCache:
                      localEnabled: true
                  install:
                    # wipe: true
                    extraKernelArgs:
                      # 1024x768 for the dashboard:
                      - vga=792
                      # Disable predictable network interface names (use eth0, eth1, etc.)
                      - net.ifnames=0
                      - -talos.halt_if_installed
            EOT,
          + <<-EOT
                "cluster":
                  "clusterName": "tiles"
                  "network":
                    "podSubnets":
                    - "10.0.144.0/20"
                    "serviceSubnets":
                    - "10.0.136.0/21"
                "version": "v1alpha1"
            EOT,
          + (known after apply),
          + <<-EOT
                "apiVersion": "v1alpha1"
                "kind": "Layer2VIPConfig"
                "link": "eth0"
                "name": "10.0.128.10"
            EOT,
        ]
      + endpoint                    = "10.0.128.11"
      + id                          = (known after apply)
      + machine_configuration       = (sensitive value)
      + machine_configuration_input = (sensitive value)
      + node                        = "10.0.128.11"
    }

  # module.cluster.module.talos-vm["tiles-cp-2"].proxmox_virtual_environment_vm.main will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7212"
      ~ ipv4_addresses                       = [
          - [
              - "127.0.0.1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "10.0.128.12",
            ],
          - [],
          - [
              - "10.0.147.164",
            ],
          - [],
          - [],
          - [],
          - [],
        ] -> (known after apply)
      ~ ipv6_addresses                       = [
          - [
              - "::1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "fe80::be24:11ff:fed0:7212",
            ],
          - [
              - "fe80::3ce6:50ff:feba:ca16",
            ],
          - [
              - "fe80::acaa:8fff:fe4e:c8e",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
        ] -> (known after apply)
        name                                 = "tiles-cp-2"
      ~ network_interface_names              = [
          - "lo",
          - "bond0",
          - "dummy0",
          - "teql0",
          - "tunl0",
          - "sit0",
          - "ip6tnl0",
          - "ens18",
          - "cilium_net",
          - "cilium_host",
          - "lxc_health",
          - "lxcac08dd99d7f0",
          - "lxc786bda410478",
          - "lxcf4df024e8678",
        ] -> (known after apply)
      ~ started                              = true -> false
        tags                                 = []
        # (30 unchanged attributes hidden)

      ~ cdrom {
          ~ file_id   = "local:iso/talos-p-v1.12.0-nocloud-amd64-10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67.iso" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-cp-2"].talos_machine_configuration_apply.this will be created
  + resource "talos_machine_configuration_apply" "this" {
      + apply_mode                  = "auto"
      + client_configuration        = (sensitive value)
      + config_patches              = [
          + <<-EOT
                version: v1alpha1
                cluster:
                  network:
                    # cilium will become our CNI.
                    cni:
                      name: none
                  controllerManager:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  scheduler:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  apiServer:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  proxy:
                    # Cilium will replace the proxy
                    disabled: true
                machine:
                  sysctls:
                    user.max_user_namespaces: "8192"
                  # https://www.talos.dev/v1.10/talos-guides/configuration/containerd/#exposing-metrics
                  files:
                    - content: |
                        [metrics]
                          address = "0.0.0.0:11234"
                      path: /etc/cri/conf.d/20-customization.part
                      op: create
                  features:
                    rbac: true
                    diskQuotaSupport: true
                    hostDNS:
                      enabled: true
                      resolveMemberNames: true
                      forwardKubeDNSToHost: false
                    imageCache:
                      localEnabled: true
                  install:
                    # wipe: true
                    extraKernelArgs:
                      # 1024x768 for the dashboard:
                      - vga=792
                      # Disable predictable network interface names (use eth0, eth1, etc.)
                      - net.ifnames=0
                      - -talos.halt_if_installed
            EOT,
          + <<-EOT
                "cluster":
                  "clusterName": "tiles"
                  "network":
                    "podSubnets":
                    - "10.0.144.0/20"
                    "serviceSubnets":
                    - "10.0.136.0/21"
                "version": "v1alpha1"
            EOT,
          + (known after apply),
          + <<-EOT
                "apiVersion": "v1alpha1"
                "kind": "Layer2VIPConfig"
                "link": "eth0"
                "name": "10.0.128.10"
            EOT,
        ]
      + endpoint                    = "10.0.128.12"
      + id                          = (known after apply)
      + machine_configuration       = (sensitive value)
      + machine_configuration_input = (sensitive value)
      + node                        = "10.0.128.12"
    }

  # module.cluster.module.talos-vm["tiles-cp-3"].proxmox_virtual_environment_vm.main will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7213"
      ~ ipv4_addresses                       = [
          - [
              - "127.0.0.1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "10.0.128.13",
            ],
          - [],
          - [
              - "10.0.145.95",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
        ] -> (known after apply)
      ~ ipv6_addresses                       = [
          - [
              - "::1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "fe80::be24:11ff:fed0:7213",
            ],
          - [
              - "fe80::7c79:eff:fed8:41ba",
            ],
          - [
              - "fe80::d847:a5ff:fe5c:ca31",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
        ] -> (known after apply)
        name                                 = "tiles-cp-3"
      ~ network_interface_names              = [
          - "lo",
          - "bond0",
          - "dummy0",
          - "teql0",
          - "tunl0",
          - "sit0",
          - "ip6tnl0",
          - "ens18",
          - "cilium_net",
          - "cilium_host",
          - "lxc_health",
          - "lxc9aeb535c4e15",
          - "lxc01da50b87ce1",
          - "lxced26fbc6e680",
          - "lxcce37852cd4a3",
          - "lxc99489cfefa2c",
          - "lxcd097edc1279c",
          - "lxcb125b840575a",
          - "lxce533cd00fe04",
          - "lxcdce8639ec06e",
          - "lxc2f307ba51da2",
        ] -> (known after apply)
      ~ started                              = true -> false
        tags                                 = []
        # (30 unchanged attributes hidden)

      ~ cdrom {
          ~ file_id   = "local:iso/talos-p-v1.12.0-nocloud-amd64-10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67.iso" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-cp-3"].talos_machine_configuration_apply.this will be created
  + resource "talos_machine_configuration_apply" "this" {
      + apply_mode                  = "auto"
      + client_configuration        = (sensitive value)
      + config_patches              = [
          + <<-EOT
                version: v1alpha1
                cluster:
                  network:
                    # cilium will become our CNI.
                    cni:
                      name: none
                  controllerManager:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  scheduler:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  apiServer:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  proxy:
                    # Cilium will replace the proxy
                    disabled: true
                machine:
                  sysctls:
                    user.max_user_namespaces: "8192"
                  # https://www.talos.dev/v1.10/talos-guides/configuration/containerd/#exposing-metrics
                  files:
                    - content: |
                        [metrics]
                          address = "0.0.0.0:11234"
                      path: /etc/cri/conf.d/20-customization.part
                      op: create
                  features:
                    rbac: true
                    diskQuotaSupport: true
                    hostDNS:
                      enabled: true
                      resolveMemberNames: true
                      forwardKubeDNSToHost: false
                    imageCache:
                      localEnabled: true
                  install:
                    # wipe: true
                    extraKernelArgs:
                      # 1024x768 for the dashboard:
                      - vga=792
                      # Disable predictable network interface names (use eth0, eth1, etc.)
                      - net.ifnames=0
                      - -talos.halt_if_installed
            EOT,
          + <<-EOT
                "cluster":
                  "clusterName": "tiles"
                  "network":
                    "podSubnets":
                    - "10.0.144.0/20"
                    "serviceSubnets":
                    - "10.0.136.0/21"
                "version": "v1alpha1"
            EOT,
          + (known after apply),
          + <<-EOT
                "apiVersion": "v1alpha1"
                "kind": "Layer2VIPConfig"
                "link": "eth0"
                "name": "10.0.128.10"
            EOT,
        ]
      + endpoint                    = "10.0.128.13"
      + id                          = (known after apply)
      + machine_configuration       = (sensitive value)
      + machine_configuration_input = (sensitive value)
      + node                        = "10.0.128.13"
    }

  # module.cluster.module.talos-vm["tiles-wk-1"].proxmox_virtual_environment_vm.main will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7221"
      ~ ipv4_addresses                       = [
          - [
              - "127.0.0.1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "10.0.128.21",
            ],
          - [],
          - [
              - "10.0.144.31",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
        ] -> (known after apply)
      ~ ipv6_addresses                       = [
          - [
              - "::1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "fe80::be24:11ff:fed0:7221",
            ],
          - [
              - "fe80::4881:b8ff:fe10:8797",
            ],
          - [
              - "fe80::e09b:d3ff:fe09:60a4",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
        ] -> (known after apply)
        name                                 = "tiles-wk-1"
      ~ network_interface_names              = [
          - "lo",
          - "bond0",
          - "dummy0",
          - "teql0",
          - "tunl0",
          - "sit0",
          - "ip6tnl0",
          - "ens18",
          - "cilium_net",
          - "cilium_host",
          - "lxc_health",
          - "lxcfd1650bc4228",
          - "lxce3c539b5ffa6",
          - "lxc3ec4ed5665c6",
          - "lxc91d46ae21450",
          - "lxc5a326e9b8a22",
          - "lxc9fa87e4cc9da",
          - "lxc9059fa013b5d",
          - "lxcffaf59bde515",
          - "lxc87e5f5f6dc17",
          - "lxca392b5fc353e",
          - "lxc231ef142b1a9",
        ] -> (known after apply)
      ~ started                              = true -> false
        tags                                 = []
        # (30 unchanged attributes hidden)

      ~ cdrom {
          ~ file_id   = "local:iso/talos-p-v1.12.0-nocloud-amd64-10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67.iso" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-wk-1"].talos_machine_configuration_apply.this will be created
  + resource "talos_machine_configuration_apply" "this" {
      + apply_mode                  = "auto"
      + client_configuration        = (sensitive value)
      + config_patches              = [
          + <<-EOT
                version: v1alpha1
                cluster:
                  network:
                    # cilium will become our CNI.
                    cni:
                      name: none
                  controllerManager:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  scheduler:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  apiServer:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  proxy:
                    # Cilium will replace the proxy
                    disabled: true
                machine:
                  sysctls:
                    user.max_user_namespaces: "8192"
                  # https://www.talos.dev/v1.10/talos-guides/configuration/containerd/#exposing-metrics
                  files:
                    - content: |
                        [metrics]
                          address = "0.0.0.0:11234"
                      path: /etc/cri/conf.d/20-customization.part
                      op: create
                  features:
                    rbac: true
                    diskQuotaSupport: true
                    hostDNS:
                      enabled: true
                      resolveMemberNames: true
                      forwardKubeDNSToHost: false
                    imageCache:
                      localEnabled: true
                  install:
                    # wipe: true
                    extraKernelArgs:
                      # 1024x768 for the dashboard:
                      - vga=792
                      # Disable predictable network interface names (use eth0, eth1, etc.)
                      - net.ifnames=0
                      - -talos.halt_if_installed
            EOT,
          + <<-EOT
                "cluster":
                  "clusterName": "tiles"
                  "network":
                    "podSubnets":
                    - "10.0.144.0/20"
                    "serviceSubnets":
                    - "10.0.136.0/21"
                "version": "v1alpha1"
            EOT,
          + (known after apply),
        ]
      + endpoint                    = "10.0.128.21"
      + id                          = (known after apply)
      + machine_configuration       = (sensitive value)
      + machine_configuration_input = (sensitive value)
      + node                        = "10.0.128.21"
    }

  # module.cluster.module.talos-vm["tiles-wk-2"].proxmox_virtual_environment_vm.main will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7222"
      ~ ipv4_addresses                       = [
          - [
              - "127.0.0.1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "10.0.128.22",
            ],
          - [],
          - [
              - "10.0.149.37",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
        ] -> (known after apply)
      ~ ipv6_addresses                       = [
          - [
              - "::1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "fe80::be24:11ff:fed0:7222",
            ],
          - [
              - "fe80::4cf9:14ff:fe00:8527",
            ],
          - [
              - "fe80::acea:57ff:fe2a:f3c5",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
        ] -> (known after apply)
        name                                 = "tiles-wk-2"
      ~ network_interface_names              = [
          - "lo",
          - "bond0",
          - "dummy0",
          - "teql0",
          - "tunl0",
          - "sit0",
          - "ip6tnl0",
          - "ens18",
          - "cilium_net",
          - "cilium_host",
          - "lxc_health",
          - "lxc50ebc1f3cb57",
          - "lxc9531cbd99559",
          - "lxc739aa40f75e9",
          - "lxc346ae39f33e1",
          - "lxc54ffe6f572cd",
          - "lxcffd12c3523da",
          - "lxcc2378b47d139",
          - "lxc33c87fdb91b1",
          - "lxc017fad6f581a",
        ] -> (known after apply)
      ~ started                              = true -> false
        tags                                 = []
        # (30 unchanged attributes hidden)

      ~ cdrom {
          ~ file_id   = "local:iso/talos-p-v1.12.0-nocloud-amd64-10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67.iso" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-wk-2"].talos_machine_configuration_apply.this will be created
  + resource "talos_machine_configuration_apply" "this" {
      + apply_mode                  = "auto"
      + client_configuration        = (sensitive value)
      + config_patches              = [
          + <<-EOT
                version: v1alpha1
                cluster:
                  network:
                    # cilium will become our CNI.
                    cni:
                      name: none
                  controllerManager:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  scheduler:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  apiServer:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  proxy:
                    # Cilium will replace the proxy
                    disabled: true
                machine:
                  sysctls:
                    user.max_user_namespaces: "8192"
                  # https://www.talos.dev/v1.10/talos-guides/configuration/containerd/#exposing-metrics
                  files:
                    - content: |
                        [metrics]
                          address = "0.0.0.0:11234"
                      path: /etc/cri/conf.d/20-customization.part
                      op: create
                  features:
                    rbac: true
                    diskQuotaSupport: true
                    hostDNS:
                      enabled: true
                      resolveMemberNames: true
                      forwardKubeDNSToHost: false
                    imageCache:
                      localEnabled: true
                  install:
                    # wipe: true
                    extraKernelArgs:
                      # 1024x768 for the dashboard:
                      - vga=792
                      # Disable predictable network interface names (use eth0, eth1, etc.)
                      - net.ifnames=0
                      - -talos.halt_if_installed
            EOT,
          + <<-EOT
                "cluster":
                  "clusterName": "tiles"
                  "network":
                    "podSubnets":
                    - "10.0.144.0/20"
                    "serviceSubnets":
                    - "10.0.136.0/21"
                "version": "v1alpha1"
            EOT,
          + (known after apply),
        ]
      + endpoint                    = "10.0.128.22"
      + id                          = (known after apply)
      + machine_configuration       = (sensitive value)
      + machine_configuration_input = (sensitive value)
      + node                        = "10.0.128.22"
    }

  # module.cluster.module.talos-vm["tiles-wk-3"].proxmox_virtual_environment_vm.main will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7223"
      ~ ipv4_addresses                       = [
          - [
              - "127.0.0.1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "10.0.128.23",
            ],
          - [],
          - [
              - "10.0.146.147",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
        ] -> (known after apply)
      ~ ipv6_addresses                       = [
          - [
              - "::1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "fe80::be24:11ff:fed0:7223",
            ],
          - [
              - "fe80::7803:8eff:fe06:58ef",
            ],
          - [
              - "fe80::9823:1cff:fe50:e434",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
        ] -> (known after apply)
        name                                 = "tiles-wk-3"
      ~ network_interface_names              = [
          - "lo",
          - "bond0",
          - "dummy0",
          - "teql0",
          - "tunl0",
          - "sit0",
          - "ip6tnl0",
          - "ens18",
          - "cilium_net",
          - "cilium_host",
          - "lxc_health",
          - "lxcc44ef46107ba",
          - "lxc9b84b2aa4dfc",
          - "lxca5db610681f0",
          - "lxc5752eb3cc5e5",
          - "lxcf68d8baf7dd6",
          - "lxc2c611a8e796c",
          - "lxc0172b45d31b1",
          - "lxc495988a43d85",
          - "lxc9a8e201826fc",
          - "lxce9ce22c8b2bc",
          - "lxc072ed5119e0c",
          - "lxcc06bea4f3c89",
          - "lxcf8fe9591c259",
          - "lxce7698b494be0",
          - "lxce1c45cf7eeea",
        ] -> (known after apply)
      ~ started                              = true -> false
        tags                                 = []
        # (30 unchanged attributes hidden)

      ~ cdrom {
          ~ file_id   = "local:iso/talos-p-v1.12.0-nocloud-amd64-10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67.iso" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-wk-3"].talos_machine_configuration_apply.this will be created
  + resource "talos_machine_configuration_apply" "this" {
      + apply_mode                  = "auto"
      + client_configuration        = (sensitive value)
      + config_patches              = [
          + <<-EOT
                version: v1alpha1
                cluster:
                  network:
                    # cilium will become our CNI.
                    cni:
                      name: none
                  controllerManager:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  scheduler:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  apiServer:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  proxy:
                    # Cilium will replace the proxy
                    disabled: true
                machine:
                  sysctls:
                    user.max_user_namespaces: "8192"
                  # https://www.talos.dev/v1.10/talos-guides/configuration/containerd/#exposing-metrics
                  files:
                    - content: |
                        [metrics]
                          address = "0.0.0.0:11234"
                      path: /etc/cri/conf.d/20-customization.part
                      op: create
                  features:
                    rbac: true
                    diskQuotaSupport: true
                    hostDNS:
                      enabled: true
                      resolveMemberNames: true
                      forwardKubeDNSToHost: false
                    imageCache:
                      localEnabled: true
                  install:
                    # wipe: true
                    extraKernelArgs:
                      # 1024x768 for the dashboard:
                      - vga=792
                      # Disable predictable network interface names (use eth0, eth1, etc.)
                      - net.ifnames=0
                      - -talos.halt_if_installed
            EOT,
          + <<-EOT
                "cluster":
                  "clusterName": "tiles"
                  "network":
                    "podSubnets":
                    - "10.0.144.0/20"
                    "serviceSubnets":
                    - "10.0.136.0/21"
                "version": "v1alpha1"
            EOT,
          + (known after apply),
        ]
      + endpoint                    = "10.0.128.23"
      + id                          = (known after apply)
      + machine_configuration       = (sensitive value)
      + machine_configuration_input = (sensitive value)
      + node                        = "10.0.128.23"
    }

Plan: 15 to add, 7 to change, 5 to destroy.

Changes to Outputs:
  - bootstrap_node         = "10.0.128.11" -> null
  - cluster_endpoint       = "https://10.0.128.10:6443" -> null
  ~ control_plane_config   = (sensitive value)
  - control_plane_ips      = [
      - "10.0.128.11",
      - "10.0.128.12",
      - "10.0.128.13",
    ] -> null
  + metal_amd_iso_url      = (known after apply)
  + metal_amd_schematic_id = (known after apply)
  - schematic_id           = "10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67" -> null
  + vm_schematic_id        = (known after apply)
  - vms_started            = true -> null
  ~ worker_config          = (sensitive value)

  ```

  </details>
  
  